app/controllers/users_controller.rb

  def index
    @title = "All Users"
    @users = User.paginate( :page => params[:page])
---
SELECT * FROM "users" LIMIT 30 OFFSET 0
SELECT count(*) AS count_all FROM "users"

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("name", "encrypted_password", "salt", "updated_at", "remember_token", "email", "created_at") VALUES('balint domokos', '26ea93464eae3fa1e6ed4e30a87eea59306153c41223b8e9c94cfaa8e4dcb656', '6a7ee1e15fb5ec232ca055286c4a6df6a49a37cb51ceaeb0f90318e76eac85e4', '2010-05-26 22:03:18', NULL, 'bdomokos74@yahoo.com', '2010-05-26 22:03:18')

  def update
    if @user.update_attributes(params[:user])
---
UPDATE "users" SET "email" = 'bdomokos74@yahoo.co', "updated_at" = '2010-05-29 22:34:55', "encrypted_password" = '00a897d5867efbe0aeb1adb2607d2d52d0ec370d4921eae67e4bcae2dff33fbf', "salt" = '25fef9b2932b72d7a004b0797e2b272bbeb41ec85e299650d36810eb528480ae' WHERE "id" = 3

  def destroy
    User.find(params[:id]).destroy
---
DELETE FROM "users" WHERE "id" = 7
SELECT * FROM "users" WHERE ("users"."id" = 7)